# CategoryName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerKey..::..CategoryName Property
ExportLayerKey Class See Also
---
The category name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string CategoryName { get; set; }
```

Visual Basic
---
```text
Public Property CategoryName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ CategoryName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExportLayerKey Class
Autodesk.Revit.DB Namespace